class DetailContent {
  static const String serviceAgreement =
  '''
제1조 (목적)
인하 카풀은 택시 공유 서비스를 제공하는 플랫폼으로, 사용자들을 매칭하여 출발지와 목적지 간의 거리를 계산하고 채팅 기능을 통해 사용자들끼리 소통할 수 있도록 합니다. 이를 통해 사용자들은 택시를 이용하면서 택시비를 절약할 수 있습니다.

제2조 (정의)
1. "인하 카풀"은 택시 공유 서비스를 이용자에게 제공하기 위해 개발된 모바일 플랫폼을 말합니다.
2. "이용자"란 "인하 카풀" 서비스를 이용하는 모든 회원 및 비회원을 지칭합니다.

제3조 (서비스 제공 및 변경)
1. "인하 카풀"은 택시를 나누는데 필요한 정보를 제공하며, 서비스의 내용이 변경되는 경우 이를 사용자에게 통지합니다.

제4조 (위치정보 및 거리 계산)
1. "인하 카풀"은 사용자의 위치정보를 활용하여 출발지와 목적지 간의 거리 및 사용자와 출발지까지의 거리를 계산하고 표시합니다.

제5 조 (개인정보 보호의무)
1. 회사는 관계법령이 정하는 바에 따라 회원 등록정보를 포함한 회원의 개인 정보를 보호하기 위해 노력합니다. 회원의 개인 정보 보호 및 사용에 대해서는 관련 법령 및 회사의 개인정보 취급방침이 적용됩니다. 단, 회사의 공식 사이트 이외에 링크된 사이트에서는 회사의 개인정보 취급방침이 적용되지 않을 수 있습니다.
2. 회사는 회원의 귀책사유로 인해 노출된 회원의 개인 및 계정 정보를 비롯한 모든 정보에 대해서는 일체의 책임을 지지 않습니다.
3. 회사는 서비스를 통하여 호출이 이루어진 경우 카풀(합승) 서비스 당사자 간 원활한 의사소통 및 배차, 상담 등 거래 이행을 위하여 관련된 정보를 필요한 범위 내에서 해당 당사자에게 제공할 수 있습니다.

제6 조 (개인정보의 변경, 회원의 의무)
1. 회원은 가입 시 기재한 개인의 정보가 변경되었을 경우에는 변경 사항을 최신의 정보로 수정하여야 합니다. 단, 이름, 성별, 회원 ID 등 변경이 불가능한 사항은 수정할 수 없습니다.
2. 회원은 본 약관에서 규정하는 사항과 서비스 이용에 대한 안내 등 회사가 공지 또는 통지하는 사항을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 하여서는 안됩니다.
3. 회원은 회원의 ID 및 비밀번호가 도용되거나 제3자가 사용하고 있음을 인지한 경우, 이를 즉시 회사에 통지하고 회사의 안내에 따라야 하며, 해당 사실을 회사에 통지하지 않았거나 통지한 경우에도 회사의 안내를 따르지 않아 발생한 불이익에 대하여는 회사가 책임지지 않습니다.
4. 회원의 ID와 비밀번호에 관한 관리 책임은 회원에게 있으며, 회원의 관리 소홀에 따라 제3자가 이용하게 되어 피해가 발생했을 경우에는 회사가 책임지지 않습니다.
5. 회원은 관련 법령, 본 약관의 규정, 서비스 이용과 관련하여 공지한 이용 안내 및 주의사항, 회사가 통지하는 각종 사항 등을 준수하여야 하며, 회사가 관련 법 및 개인정보 취급방침에 따라 책임을 지는 경우를 제외하고 관리 소홀 및 부정 사용 등에 의하여 발생하는 모든 결과에 대한 책임은 회원에게 있습니다.
6. 회원은 회사의 명시적인 동의가 없는 한 서비스의 이용 권한, 기타 이용 계약상의 지위를 타인에게 양도하거나 증여하거나 담보로 제공할 수 없습니다.
7. 회원은 회사의 서비스 이용 중 버그나 시스템 오류 등의 문제가 발생할 경우, 회사에 문제 사항에 대한 안내를 해야 하며, 이를 다른 회원에게 전파하거나 의도적으로 악용할 경우 관계 법령에 의해 처벌받을 수 있습니다.
8. 회원은 관계 법령에 의하여 전송 또는 게시가 금지되는 정보(컴퓨터프로그램), 컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해하거나 파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터의 코드나 파일 또는 프로그램을 포함하고 있는 자료를 전송, 게시, 유포, 사용하는 행위를 할 경우, 관계 법령에 의해 처벌받을 수 있습니다.
9. 회원은 관계 법령 및 약관의 규정을 비롯하여 회사가 통지하는 사항을 준수하여야 하며, 회사의 서비스 운영을 고의로 방해하거나 서비스의 안정적인 운영을 방해할 수 있는 정보 및 수신자의 명시적인 수신거부 의사에 반하여 광고 목적의 정보를 전송하는 행위를 해서는 안 됩니다.
10. 회원은 서비스 이용과 관련하여 다음과 같은 행위를 하여서는 되지 않으며, 해당 조항에서 정하는 행위가 확인될 경우 회사는 회원의 서비스 이용을 일부 또는 모두 제한할 수 있습니다.

① 가입신청 시 입력한 정보가 허위로 판명된 경우
② 다른 회원으로부터 이용 불편에 대한 신고가 접수된 경우
③ 가입 시 등록했던 결제수단이 유효기간이 만료되었거나 취소된 경우
④ 타인으로 가장하는 행위 및 타인과의 관계를 허위로 명시하는 행위
⑤ 버그를 악용하는 행위 또는 정상적이지 않은 방법으로 회사에서 제공하는 재화를 획득하는 행위
⑥ 외설, 폭력적인 메시지, 화상, 음성, 기타 미풍양속에 반하는 정보를 회사에 공개 또는 게시하는 행위
⑦ 기타 본 약관 및 관계 법령에서 정한 사항을 위반하거나 불이행하는 경우
  1. 회원은 회사가 지정한 사이트 또는 기타의 방법으로 안내한 공지사항을 수시로 확인해야 합니다.

제7 조 (약관 외 준칙)
1. 본 약관은 회사가 제공하는 서비스에 관하여 별도의 정책 및 운영 규칙과 함께 적용됩니다.
2. 회사는 본 약관의 적용과 함께 유료 서비스 및 개별 서비스에 대한 별도의 이용 약관과 정책을 제시하여 적용할 수 있습니다.
3. 본 약관에서 정하지 아니한 사항과 본 약관의 해석에 관하여는 관련 법 또는 상관례에 따릅니다.

제 8조 (회원의 금지행위)
1. 회원은 서비스를 이용할 때 다음 각 호의 행위를 하여서는 아니 됩니다.
① 이용 신청 또는 변경 시 허위 사실을 기재하거나, 다른 회원의 계정을 도용, 부정하게 사용하거나, 이동 전화 명의자의 허락 없이 실사용자가 “SMS 인증”, 범용 공인인증 또는 신용카드인 증 등을 수행하는 행위
② 회사의 서비스 정보를 이용하여 얻은 정보를 회사의 사전 승낙 없이 복제 또는 유통하거나 상업적으로 이용하는 행위
③ 타인의 명예를 손상시키거나 불이익을 주는 행위
④ 게시판 등에 음란물을 게재하거나 음란사이트를 연결(링크) 하는 행위
⑤ 회사 또는 제3자의 저작권 등 기타 권리를 침해하는 행위
⑥ 공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형, 음성 등을 타인에게 유포하는 행위
⑦ 서비스와 관련된 설비의 오 동작이나 정보 등의 파괴 및 혼란을 유발하는 컴퓨터 바이러스 감염 자료를 등록 또는 유포하는 행위
⑧ 서비스 운영을 고의로 방해하거나 서비스의 안정적 운영을 방해할 수 있는 정보 및 수신자의 명시적인 수신거부 의사에 반하여 광고성 정보 또는 스팸메일(Spam Mail)을 전송하는 행위
⑨ 다른 회원의 개인정보를 수집, 저장, 공개하는 행위
⑩ 스토킹(stalking), 외설 또는 폭력적인 언행, 기타 미풍양속을 해치는 행위 등으로 다른 회원을 괴롭히는 행위
⑪ 탑승의사 없이 호출하거나 호출에 응하는 행위
⑫ 택시 호출 시 실제 목적지와 상이한 목적지를 선택하거나, 택시를 호출하여 배차가 완료된 이후 경로 변경을 요구하여 동승한 다른 회원에게 불편을 초래하는 행위
⑬ 택시 호출 후 배차가 완료되었음에도 탑승하지 않아 동승한 다른 회원에게 불편을 초래하는 행위
⑭ 만취한 상태로 탑승하여 동승한 다른 회원에게 불편을 초래하는 행위
⑮ 인원을 초과하여 동승하거나, 과도한 짐을 가지고 동승하여 다른 회원에게 불편을 초래하는 행위
1. 회원은 관계 법령, 본 약관의 규정, 서비스 정책, 이용안내 및 서비스상에 공지한 주의사항, 회사가 통지하는 사항 등을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 하여서는 아니 됩니다.
2. 회원이 명시된 금행위를 한 경우에 회사는 부가적으로 제공한 혜택의 일부 또는 전부의 회수, 특정 서비스의 이용 제한, 이용계약의 해지, 손해배상의 청구 등의 조치를 할 수 있습니다
  ''';

  static const String privacyAgreement =
  '''
개인정보 처리 방침
제1조(목적)
1. 오브젝트(이하 ‘회사'라고 함)는 회사가 제공하고자 하는 서비스(이하 ‘회사 서비스’)를 이용하는 개인(이하 ‘이용자’ 또는 ‘개인’)의 정보(이하 ‘개인정보’)를 보호하기 위해, 개인정보보호법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률(이하 '정보통신망법') 등 관련 법령을 준수하고, 서비스 이용자의 개인정보 보호 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리 방침(이하 ‘본 방침’)을 수립합니다.

제2조(개인정보 처리의 원칙)
2. 개인정보 관련 법령 및 본 방침에 따라 회사는 이용자의 개인정보를 수집할 수 있으며 수집된 개인정보는 개인의 동의가 있는 경우에 한 해 제3자에게 제공될 수 있습니다. 단, 법령의 규정 등에 의해 적법하게 강제되는 경우 회사는 수집한 이용자의 개인정보를 사전에 개인의 동의 없이 제3자에게 제공할 수도 있습니다.

제3조(본 방침의 공개)
1. 회사는 이용자가 언제든지 쉽게 본 방침을 확인할 수 있도록 회사 홈페이지 첫 화면 또는 첫 화면과의 연결 화면을 통해 본 방침을 공개하고 있습니다.
2. 회사는 제1항에 따라 본 방침을 공개하는 경우 글자 크기, 색상 등을 활용하여 이용자가 본 방침을 쉽게 확인할 수 있도록 합니다.

제4조(본 방침의 변경)
1. 본 방침은 개인정보 관련 법령, 지침, 고시 또는 정부나 회사 서비스의 정책이나 내용의 변경에 따라 개정될 수 있습니다.
2. 회사는 제1항에 따라 본 방침을 개정하는 경우 다음 각 호 하나 이상의 방법으로 공지합니다.
	가. 회사가 운영하는 인터넷 홈페이지의 첫 화면의 공지사항란 또는 별도의 창을 통하여 공지하는 방법
	나. 서면·모사전송·전자우편 또는 이와 비슷한 방법으로 이용자에게 공지하는 방법
3. 회사는 제2항의 공지는 본 방침 개정의 시행 일로부터 최소 7일 이전에 공지합니다. 다만, 이용자 권리의 중요한 변경이 있을 경우에는 최소 30일 전에 공지합니다.

제5조(회원 가입을 위한 정보)
회사는 이용자의 회사 서비스에 대한 회원가입을 위하여 다음과 같은 정보를 수집합니다.
1. 필수 수집 정보: 이메일 주소, 이름 및 닉네임

제6조(본인 인증을 위한 정보)
1. 회사는 이용자의 본인인증을 위하여 다음과 같은 정보를 수집합니다.
2. 필수 수집 정보: 이메일 주소, 이름 및 성별 

제7조(개인정보 수집 방법)
1. 회사는 다음과 같은 방법으로 이용자의 개인정보를 수집합니다.
2. 이용자가 회사의 홈페이지에 자신의 개인정보를 입력하는 방식

제8조(개인정보의 이용)
회사는 개인정보를 다음 각 호의 경우에 이용합니다.
1. 공지사항의 전달 등 회사의 운영에 필요한 경우
2. 이용 문의에 대한 회신, 불만의 처리 등 이용자에 대한 서비스 개선을 위한 경우
3. 회사의 서비스를 제공하기 위한 경우
4. 법령 및 회사 약관을 위반하는 회원에 대한 이용 제한 조치, 부정 이용 행위를 포함하여 서비스의 원활한 운영에 지장을 주는 행위에 대한 방지 및 제재를 위한 경우

제9조(개인정보의 보유 및 이용 기간)
1. 회사는 이용자의 개인 정보에 대해 개인정보의 수집·이용 목적이 달성을 위한 기간 동안 개인정보를 보유 및 이용합니다.
2. 전항에도 불구하고 회사는 내부 방침에 의해 서비스 부정 이용 기록은 부정 가입 및 이용 방지를 위하여 회원 탈퇴 시점으로부터 최대 1년간 보관합니다.

제10조(법령에 따른 개인정보의 보유 및 이용 기간)
회사는 관계법령에 따라 다음과 같이 개인정보를 보유 및 이용합니다.
1. 전자상거래 등에서의 소비자보호에 관한 법률에 따른 보유 정보 및 보유기간
가. 계약 또는 청약철회 등에 관한 기록 : 5년
나. 대금 결제 및 재화 등의 공급에 관한 기록 : 5년
다. 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년
라. 표시•광고에 관한 기록 : 6개월
2. 통신비밀 보호법에 따른 보유 정보 및 보유기간
가. 웹사이트 로그 기록 자료 : 3개월
3. 전자금융거래법에 따른 보유 정보 및 보유기간
가. 전자금융거래에 관한 기록 : 5년
4. 위치정보의 보호 및 이용 등에 관한 법률
가. 개인위치정보에 관한 기록 : 6개월

제11조(개인정보의 파기 원칙)
1. 회사는 원칙적으로 이용자의 개인정보 처리 목적의 달성, 보유·이용 기간의 경과 등 개인정보가 필요하지 않을 경우에는 해당 정보를 지체 없이 파기합니다.

제12조(개인정보 조회 및 수집 동의 철회)
1. 이용자는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수 있으며 개인정보 수집 동의 철회를 요청할 수 있습니다.
2. 이용자는 자신의 가입 정보 수집 등에 대한 동의를 철회하기 위해서는 개인정보보호 책임자 또는 담당자에게 서면, 전화 또는 전자우편 주소로 연락하시면 회사는 지체 없이 조치하겠습니다.

제13조(개인정보 정보 변경 등)
1. 이용자는 회사에 전조의 방법을 통해 개인정보의 오류에 대한 정정을 요청할 수 있습니다.
2. 회사는 전항의 경우에 개인정보의 정정을 완료하기 전까지 개인정보를 이용 또는 제공하지 않으며 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여 정정이 이루어지도록 하겠습니다.

제14조(이용자의 의무)
1. 이용자는 자신의 개인정보를 최신의 상태로 유지해야 하며, 이용자의 부정확한 정보 입력으로 발생하는 문제의 책임은 이용자 자신에게 있습니다.
2. 타인의 개인정보를 도용한 회원가입의 경우 이용자 자격을 상실하거나 관련 개인정보보호 법령에 의해 처벌받을 수 있습니다.
3. 이용자는 전자우편 주소, 비밀번호 등에 대한 보안을 유지할 책임이 있으며 제3자에게 이를 양도하거나 대여할 수 없습니다.

제15조(개인정보 유출 등에 대한 조치)
회사는 개인정보의 분실·도난·유출(이하 "유출 등"이라 한다) 사실을 안 때에는 지체 없이 다음 각 호의 모든 사항을 해당 이용자에게 알리고 방송통신위원회 또는 한국 인터넷진흥원에 신고합니다.
1. 유출 등이 된 개인정보 항목
2. 유출 등이 발생한 시점
3. 이용자가 취할 수 있는 조치
4. 정보통신서비스 제공자 등의 대응 조치
5. 이용자가 상담 등을 접수할 수 있는 부서 및 연락처

제16조(개인정보 유출 등에 대한 조치의 예외)
1. 회사는 전조에도 불구하고 이용자의 연락처를 알 수 없는 등 정당한 사유가 있는 경우에는 회사의 홈페이지에 30일 이상 게시하는 방법으로 전조의 통지를 갈음하는 조치를 취할 수 있습니다.
  ''';

  static const String locationAgreement =
  '''
위치기반서비스 이용약관
제1조(목적)
본 약관은 회원(오브젝트의 서비스 약관에 동의한 자를 말하며 이하 '회원'이라고 합니다)이 오브젝트(이하 '회사'라고 합니다)가 제공하는 웹페이지 및 '인하 카풀' (회사가 개발 운영하는 모바일 애플리케이션을 말합니다 이하 '모바일앱'이라고 합니다)의 서비스를 이용함에 있어 회원과 회사의 권리 및 의무, 기타 제반 사항을 정하는 것을 목적으로 합니다.

제2조(가입자격)
서비스에 가입할 수 있는 회원은 위치기반서비스를 이용할 수 있는 이동전화 단말기의 소유자 본인이어야 합니다.

제3조(서비스 가입)
회사는 다음 각 호에 해당하는 가입신청을 승낙하지 않을 수 있습니다.
1. 실명이 아니거나 타인의 명의를 사용하는 등 허위로 신청하는 경우
2. 고객 등록 사항을 누락하거나 오기하여 신청하는 경우
3. 공공질서 또는 미풍양속을 저해하거나 저해할 목적을 가지고 신청하는 경우
4. 기타 회사가 정한 이용 신청 요건이 충족되지 않았을 경우

제4조(서비스 해지)
회원은 회사가 정한 절차를 통해 서비스 해지를 신청할 수 있습니다.

제5조(이용 약관의 효력 및 변경)
1. 본 약관은 서비스를 신청한 고객 또는 개인위치정보주체가 회사가 정한 소정의 절차에 따라 회원으로 등록함으로써 효력이 발생합니다.
2. 서비스를 신청한 고객 또는 개인위치정보주체가 온라인에서 본 약관을 모두 읽고 "동의하기" 버튼을 클릭하였을 경우 본 약관의 내용을 모두 읽고 이를 충분히 이해하였으며, 그 적용에 동의한 것으로 봅니다.
3. 본 약관에 대하여 동의하지 않은 경우, 회사가 개인위치정보를 기반으로 제공하는 각종 혜택 및 편의제공에 일부 제한이 발생할 수 있습니다.
4. 회사는 필요한 경우 '위치 정보의 보호 및 이용 등에 관한 법률, '콘텐츠산업 진흥법', '전자상거래 등에서의 소비자보호에 관한 법률', '소비자기본법', '약관의 규제에 관한 법률 등 관계법령(이하 '관계법령'이라 합니다)의 범위 내에서 본 약관을 개정할 수 있습니다.
5. 회사가 약관을 개정할 경우 기존 약관과 개정 약관 및 개정 약관의 적용일자와 개정 사유를 명시하여 현행 약관과 함께 그 적용일자 10일 전부터 적용일 이후 상당한 기간 동안 회사의 웹페이지 및 모바일앱을 통해 공지합니다. 다만, 개정 약관의 내용이 회원에게 새로운 의무를 부과하거나 권리를 제한하는 내용인 경우 그 적용일자 30일 전부터 상당한 기간 동안 이를 회사의 웹페이지 및 모바일앱을 통해 공지하고, 회원에게 전자적 형태로 약관의 개정 사실을 발송하여 고지합니다.

제6조(약관 외 준칙)
본 약관은 신의성실의 원칙에 따라 공정하게 적용하며, 본 약관에 명시되지 아니한 사항에 대하여는 관계법령 및 건전한 거래 관행에 따릅니다.

제7조(서비스의 내용)
회사가 제공하는 서비스는 아래와 같습니다. 
1. 카풀 출발지와 도착지의 위치정보 제공
2. 회원의 위치와 출발지 간의 거리 제공

제8조(서비스 이용요금)
1. 회사의 서비스는 무료제공을 원칙으로 합니다. 
2. 전항에도 불구하고 무선 서비스 이용 시 발생하는 데이터 통신료는 별도이며, 이때 부과되는 데이터 통신료는 회원이 가입한 각 이동통신사의 정책에 따릅니다.

제9조(서비스 내용 변경 통지 등)
1. 회사가 서비스 내용을 변경하거나 종료하는 경우 회사는 회원이 등록한 전자우편 주소로 이메일을 발송하여 서비스 내용의 변경 사항 또는 종료를 사전 일주일 전에 통지합니다.
2. 전항의 경우 불특정 다수의 회원을 상대로 통지하는 때에는 회사의 웹페이지 등을 통해 공지함으로써 회원들에게 통지할 수 있습니다.

제10조(서비스 이용의 제한 및 중지)
1. 회사는 아래 각 호에 해당하는 사유가 발생한 경우에는 회원의 서비스 이용을 제한하거나 중지시킬 수 있습니다. 
가. 회원이 회사의 서비스 운영을 고의 또는 과실로 방해하는 경우 
나. 서비스용 설비 점검, 보수 또는 공사로 인하여 부득이한 경우 
다. 전기통신사업법에 규정된 기간 통신 사업자가 서비스를 중지했을 경우
라. 국가비상사태, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 서비스 이용에 지장이 있는 때 
마. 기타 중대한 사유로 회사가 서비스 제공을 지속하는 것이 곤란한 경우 
2. 회사가 전항에 따라 서비스의 이용을 제한하거나 중지한 때에는 해당 사실을 인터넷 등에 공지하거나 고객에게 통지합니다. 다만 회사가 통제할 수 없는 사유로 인하여 서비스를 중단하게 되는 경우 이를 사후에 통지할 수 있습니다. 
가. 개인위치정보를 수집한 통신 단말장치가 문자, 음성 또는 영상 수신 기능을 갖추지 아니한 경우 
나. 회원이 다른 방법을 요청한 경우

제11조(개인위치정보 주체의 권리)
1. 회원은 회사에 대하여 언제든지 개인위치정보를 이용한 위치기반서비스 제공 및 개인위치정보의 제3자 제공에 대한 동의의 전부 또는 일부를 철회할 수 있습니다. 이 경우 회사는 수집한 개인위치정보 및 위치정보 이용, 제공 사실 확인자료를 파기합니다. 
2. 회원은 회사에 대하여 언제든지 개인위치정보의 수집, 이용 또는 제공의 일시적인 중지를 요구할 수 있습니다.
3. 회원은 회사에 대하여 아래 각 호의 자료에 대한 열람 또는 고지를 요구할 수 있고, 당해 자료에 오류가 있는 경우에는 그 정정을 요구할 수 있습니다. 이 경우 회사는 정당한 사유 없이 회원의 요구를 거절할 수 없습니다.
가. 본인에 대한 위치정보 이용, 제공 사실 확인자료 
나. 본인의 위치정보가 제3자에게 제공된 이유 및 내용
4. 회원은 회사가 정한 절차에 따라 제1항 내지 제3항의 권리를 행사할 수 있습니다. 

제12조(위치정보관리 책임자의 지정)
1. 회사는 위치정보를 적절히 관리, 보호하고 개인위치정보주체의 불만을 원활히 처리할 수 있도록 실질적인 책임을 질 수 있는 지위에 있는 자를 위치정보의 관리 책임자로 지정하고 운영합니다.
2. 회사의 위치정보관리 책임자는 위치기반서비스의 제공에 관한 제반 사항을 담당 · 관리하는 부서의 총괄팀장으로서, 구체적인 사항은 본 약관의 부칙에 따릅니다.

제13조(손해배상)
1. 회사가 위치정보의 보호 및 이용 등에 관한 법률 제15조 내지 제26조의 규정을 위반한 행위를 하여 회원에게 손해가 발생한 경우 회원은 회사에 대하여 손해배상 청구를 할 수 있습니다.
2. 회원이 고의 또는 과실로 본 약관의 규정을 위반하여 회사에 손해가 발생한 경우 회원은 회사에 발생한 모든 손해를 배상해야 합니다.

제14조(면책)
1. 회사는 다음 각 호의 사유로 서비스를 제공할 수 없는 경우 이로 인하여 회원에게 발생한 손해에 대한 책임을 부담하지 않습니다. 
	가. 천재지변 또는 이에 준하는 불가항력의 상태가 있는 경우
	나. 제3자의 고의적인 서비스 방해가 있는 경우 
	다. 회원의 귀책사유로 서비스 이용에 장애가 있는 경우 
	라. 기타 회사의 고의 또는 과실이 없는 사유에 해당하는 경우 
2. 회사는 서비스 및 서비스에 게재된 정보, 자료, 사실의 신뢰도 및 정확성 등에 대한 보증을 하지 않으며 이로 인하여 회원에게 발생한 손해에 대하여 책임을 부담하지 않습니다.
3. 회사는 회원이 서비스를 이용하며 기대하는 수익을 상실한 것에 대한 책임과, 그 밖의 서비스를 통하여 얻은 자료로 인하여 회원에게 발생한 손해에 대한 책임을 부담하지 않습니다. 

제15조(분쟁의 조정)
1. 회사는 위치정보와 관련된 분쟁에 대해 당사자 간 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는 '위치정보의 보호 및 이용 등에 관한 법률' 제28조의 규정에 따라 방송통신위원회에 재정을 신청할 수 있습니다.
2. 회사 또는 고객은 위치정보와 관련된 분쟁에 대해 당사자 간 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는 '개인정보보호법' 제43조의 규정에 따라 개인정보분쟁 조정위원회에 조정을 신청할 수 있습니다.
  ''';
}